---
kind: type
id: T:Autodesk.Revit.DB.AssemblyInstance
source: html/4e60704c-dfe3-72b6-7892-6440503fa078.htm
---
# Autodesk.Revit.DB.AssemblyInstance

Combines multiple elements for tagging, filtering, scheduling and creating isolated assembly views.

## Syntax (C#)
```csharp
public class AssemblyInstance : Element
```